CSI API ETABS v1
cDatabaseTables.SetTableForEditingArray Method
 Reads a table from a string array and adds it to a stored table list until either the ApplyEditedTables(Boolean, Int32, Int32, Int32, Int32, String) or CancelTableEditing() command is issued.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTableForEditingArray(
	string TableKey,
	ref int TableVersion,
	ref string[] FieldsKeysIncluded,
	int NumberRecords,
	ref string[] TableData
)
Function SetTableForEditingArray (
	TableKey As String,
	ByRef TableVersion As Integer,
	ByRef FieldsKeysIncluded As String(),
	NumberRecords As Integer,
	ByRef TableData As String()
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim TableVersion As Integer
Dim FieldsKeysIncluded As String()
Dim NumberRecords As Integer
Dim TableData As String()
Dim returnValue As Integer
returnValue = instance.SetTableForEditingArray(TableKey,
	TableVersion, FieldsKeysIncluded,
	NumberRecords, TableData)
int SetTableForEditingArray(
	String^ TableKey,
	int% TableVersion,
	array<String^>^% FieldsKeysIncluded,
	int NumberRecords,
	array<String^>^% TableData
)
abstract SetTableForEditingArray :
        TableKey : string *
        TableVersion : int byref *
        FieldsKeysIncluded : string[] byref *
        NumberRecords : int *
        TableData : string[] byref -> int
Parameters
TableKey
Type: System.String
Input Item: The table key for a table which has been interactively edited. The table must be one that can be interactively edited.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
FieldsKeysIncluded
Type: System.String[]
 Input Item: A zero-based array listing the field keys associated with the specified table for which data is reported in the order it is reported in the TableData array. These are essentially the column headers of the data reported in TableData.
NumberRecords
Type: System.Int32
Input Item: The number of records of data for each field. This is essentially the number of rows of data.
TableData
Type: System.String[]
 Input Item: A zero-based, one-dimensional array of the table data, excluding headers, reported row by row. See GetTableForDisplayArray(String, String[], String, Int32, String[], Int32, String[]) for a more detailed explanation of the data format.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 Here is an example of how to set the inputs:
TableKey = "EXAMPLE Material Table"
FieldsKeysIncluded = {"Material Name", "Material Type", "Density"}
NumberRecords = 5
TableData = {A992Fy50, Steel, 490, 4000Psi, Concrete, 150, A615Gr60, Rebar, 480, A416Gr270, Tendon, 470, 6061T6, Aluminum, 170}
Executing the function with these inputs would be equivalent to setting the following table interactively:
EXAMPLE Material Name | Type | Density
A992Fy50 | Steel | 490
4000Psi | Concrete | 150
A615Gr60 | Rebar | 480
A416Gr270 | Tendon | 470
6061T6 | Aluminum | 170
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace